export default {
  data() {
    return {
      messages: [
        {
          text: "Συγχαρητήρια! Είμαστε στην ευχάριστη θέση να ανακοινώσουμε ότι έχετε επιλεγεί να συμμετάσχετε στο οικονομικό πείραμα στην Ελλάδα!",
          type: "text",
        },
        {
          text: `Μπορείτε να αποκτήσετε πρόσβαση σε ιδιωτικές πληροφορίες που θα είναι διαθέσιμες μόνο για 50 τυχερά και τυχαία επιλεγμένα άτομα.`,
          type: "text",
        },
        {
          text: `Τα πρώτα 1.000 € σας περιμένουν! Στο τέλος αυτής της συνομιλίας, θα μάθετε πώς να κερδίζετε και να λαμβάνετε αυτό το χρηματικό ποσό.`,
          type: "text",
        },
        {
          text: `Πρώτον, απαντήστε σε αυτές τις 3 απλές ερωτήσεις:`,
          type: "text",
        },
        {
          text: "Θα θέλατε να λάβετε χρήματα σε μετρητά ή στην τραπεζική σας κάρτα;",
          answers: [
            {
              id: 0,
              answer: "Μετρητά",
            },
            {
              id: 1,
              answer: "Τραπεζική κάρτα",
            },
          ],
          type: "question",
        },
        {
          text: "Εάν βγάζατε 4.000-5.000 € μηνιαίως, θα αρχίζατε να δίνετε χρήματα σε φιλανθρωπικά ιδρύματα;",
          answers: [
            {
              id: 2,
              answer: "Ναι",
            },
            {
              id: 3,
              answer: "Όχι",
            },
            {
              id: 4,
              answer: "Δεν ξέρω",
            },
          ],
          type: "question",
        },
        {
          text: "Θα θέλατε να λαμβάνετε εβδομαδιαία μπόνους στο κινητό σας τηλέφωνο;",
          answers: [
            {
              id: 5,
              answer: "Ναι",
            },
            {
              id: 6,
              answer: "Όχι",
            },
          ],
          type: "question",
        },
        {
          text: "Σας ευχαριστούμε για τις απαντήσεις σας!",
          type: "text",
        },
        {
          text: "Σας έχει χορηγηθεί πρόσβαση σε ιδιωτικές πληροφορίες! ",
          type: "text",
        },
        {
          text: "Καλέστε από το κινητό σας τηλέφωνο και ακούστε λεπτομερείς οδηγίες.",
          type: "text",
        },
      ],
    };
  },
};
