{
  "Завершено!": "Realizat!",
  "Сервис доступен только с 18 лет.": "TATO SLUŽBA JE K DISPOZICI PRO UŽIVATELE, KTEŘÍ DOSÁHLI 18 LET.",
  "Введите, пожалуйста, свой номер телефона, чтобы подтвердить возраст": "Zadejte své telefonní číslo pro ověření věku.",
  "подтвердить": "Ověřit",
  "Для сохранения конфиденциальности ваших персональных данных, введите, пожалуйста, свой номер телефона:": "Chcete-li ochránit své osobní údaje, zadejte své telefonní číslo:",
  "Для доступа к сервису введите свой номер телефона:": "Chcete-li získat přístup ke službě, zadejte své telefonní číslo:",
  "Введите свой номер телефона, чтобы получить возможность": "Zadejte své telefonní číslo a získejte příležitost",
  "выиграть Iphone11": "vyhrát iPhone 11",
  "Это очень личная и очень важная для вас информация.": "TATO INFORMACE JE PRO VÁS OSOBNÍ A DŮLEŽITÁ",
  "Чтобы получить к ней доступ, подтвердите свой номер телефона, введя его в это поле": "Pro získání přístupu k této informaci, ověřte své telefonní číslo zadáním telefonního čísla do tohoto pole",
  "Эта запись предназначена только для вас.": "TATO NAHRÁVKA JE POUZE PRO VÁS",
  "Чтобы получить персональный доступ к ней, введите, пожалуйста, свой номер телефона": "Abyste získali osobní přístup, zadejte prosím své telefonní číslo",
  "Посещений": "Účast",
  "Звонков": "Hovory",
  "ВНИМАНИЕ": "POZOR",
  "Для Вас оставлена запись на автоответчике с персональным прогнозом.": "Predicțiile tale personale sunt înregistrate pe un robot telefonic.",
  "Звоните со своего мобильного телефона прямо сейчас, иначе последствия могут быть необратимы!": "Sună chiar acum de pe telefonul tău, altfel consecințele pot fi ireversibile!",
  "Запись доступна только": "Tato nahrávka bude dostupná pouze po dobu",
  "мин": "min",
  "позвонить": "ZAVOLAT A",
  "и прослушать": "POSLECHNOUT",
  "Поздравляем": "FELICITĂRI",
  "Вы получили персональное аудиосообщение с критически важной для вас информацией.": "Ai primit acces la mesajul audio personalizat, cu informații vitale pentru tine.",
  "Позвоните со своего телефона и внимательно прослушайте его, это повлияет на всю вашу дальнейшую жизнь!": "Sună de pe telefonul tău și ascultă mesajul cu atenție, fiindcă va avea efecte pentru tot restul vieții!",
  "Важно": "IMPORTANT",
  "Ваш личный прогноз доступен в виде аудиозаписи на автоответчике.": "Predicțiile tale personale sunt disponibile sub forma unei înregistrări audio pe un robot telefonic.",
  "Позвоните и прослушайте его прямо сейчас, если хотите добиться потрясающих успехов во всех сферах жизни. Не упустите свой шанс!": "Sună și ascultă-le chiar acum dacă vrei să obții un succes uimitor în toate domeniile vieții. Nu rata această șansă unică!",
  "Звоните скорее!": "Sună cât mai repede!",
  "Это очень важно!": "ESTE FOARTE IMPORTANT!",
  "вы в опасности!": "EȘTI ÎN PERICOL!",
  "Для вас записано персональное аудиосообщение, которое поможет избежать беды и выйти победителем из угрожающей вам ситуации.": "Tocmai am înregistrat pentru tine un mesaj audio personal, care te va ajuta să eviți problemele și să treci cu bine peste pericolul care te amenință.",
  "Звоните скорее и получите надежную защиту!": "Sună cât mai repede și vei primi protecție completă!",
  "Вы получили голосовое сообщение на автоответчик.": "Ai primit acces la un mesaj vocal înregistrat pe un robot telefonic.",
  "Эта информация крайне важна для вас и поможет решить самую насущную проблему и реализовать давнюю мечту.": "Aceste informații sunt extrem de importante pentru tine și te vor ajuta să rezolvi cea mai presantă problemă și să-ți realizezi dorințele la care ai visat de atât de mult timp.",
  "Чтобы прослушать его, позвоните со своего мобильного прямо сейчас.": "Pentru a le asculta, sună de pe telefonul tău mobil chiar acum.",
  "BOGNA IONESCU": "Bogny Ionescu",
  "Астролог": "Astrolog",
  "Decline": "Refuză",
  "Accept": "Acceptă",
  "Сертифицированный астролог": "Certifikovaná astroložka",
  "Ответов": "Odpovědi",
  "Точность прогноза": "Predikce přesnosti",
  "День": "Den",
  "Месяц": "Měsíc",
  "Год": "Rok",
  "печатает": "píše",
  "Напишите сообщение...": "Napište zprávu...",
  "Получить гороскоп!": "Získat horoskop!",
  "Спасибо за ваши ответы:": "Îți mulțumesc pentru răspunsuri:",
  "Мы обрабатываем ваш результат": "Acum se procesează rezultatele.",
  "Анализ личного гороскопа:": "Se efectuează analiză informațiilor în vederea întocmirii horoscopului personal:",
  "Исправление знака зодиака:": "Se efectuează corecția în funcție de semnul zodiacal:",
  "Расчет вариантов ответа:": "Se efectuează calcularea opțiunilor de răspuns:",
  "Детализация вашего прогноза:": "Se stabilesc ultimele detalii legate de predicție : ",
  "Сохранение результата:": "Se salvează rezultatul:",
  "Самый точный гороскоп": "NEJPŘESNĚJŠÍ HOROSKOP",
  "от известного астролога": "Od slavné astroložky",
  "Простой": "JEDNODUCHÁ ",
  "и": "A",
  "сильный": "ÚČINNÁ ",
  "способ": "METODA",
  "Решить все ваши проблемы": "VYŘEŠÍ VŠECHNY VAŠE PROBLÉMY",
  "Прямо здесь и сейчас!": "TADY A TEĎ!",
  "Получить ответ": "Získat odpověď",
  "Личный гороскоп": "OSOBNÍ HOROSKOP",
  "Ваш индивидуальный": "VÁŠ OSOBNÍ",
  "Астрологический портрет": "ASTROLOGICKÝ PORTRÉT",
  "предупреждает!": "Vás varuje",
  "Этот гороскоп": "Tento horoskop",
  "очень мощный!": "je velmi mocný!",
  "Ваш успех привлекает негативную энергию, зависть и ненавистников. Вот это может разрушить ваш потенциал и": "Váš úspěch přitahuje negativní energii, závist a nenávist.Tyto věci mohou zničit váš",
  "испортить вашу жизнь.": " potenciál a život.",
  "Будьте осторожны со своими желаниями, они могут сбыться. Сосредоточьтесь на ключевых моментах своей жизни, которые необходимо изменить": "Dávejte si pozor na své touhy, mohou se splnit. Zaměřte se na klíčové momenty ve vašem životě, které je třeba změnit",
  "прямо сейчас!": "právě teď.",
  "Далее": "Mai departe",
  "Вопрос": "întrebare"
}