export default [
  {
    title:
      "Προτιμάτε να λάβετε τα χρήματα μέσω τραπεζικής κάρτας ή μετρητά?",
    answers: [{ text: "Τραπεζική κάρτα" }, { text: "μετρητά" }],
  },
  {
    title:
      "Εάν λαμβάνατε 9000-11000 ευρώ τον μήνα, θα ξοδεύατε μερικά από αυτά τα χρήματα σε φιλανθρωπίες?",
    answers: [
      { text: "Ναι" },
      { text: "Οχι" },
      { text: "Δεν ξέρω" },
    ],
  },
  {
    title: "Συμμετείχατε στο Πρώτο Οικονομικό Πείραμα?",
    answers: [{ text: "Ναι" }, { text: "Οχι" }, { text: "Δεν μπορούσα να έχω πρόσβαση" }],
  },
];
