<template>
    <section class="result">
        <div class="header" ref="header">
            <div class="gratz">
                Συγχαρητήρια
            </div>
            <div class="text">

                Το προσωπικό αστρολογικό ωροσκόπιο μπορεί να σε βοηθήσει να φτάσεις σε αρμονία σε όλους τους τομείς της
                ζωής σου και να αποφεύγεις τις αποτυχίες, τις οπίες έχει ετοιμάσει η ζωή για εσένα.

            </div>
        </div>
        <div class="info" :class="{infoMainClosed: !bar}">
            <div class="info-header" @click.prevent="toggleBar">
                <div class="info-header__text">Το προσωπικό σου ωροσκόπιο</div>
                <div class="toggle" :class="{toggleOpened: bar}">
                    <img src="../assets/img/tog.svg" alt="">
                </div>
            </div>
            <div class="info-content" :class="[{infoClosed: !bar},{barInactive: !bar}]"
                 :style="{minHeight: this.innerHeight - this.head - 41 + 'px'}">
                <player class="player"/>
                <div class="info-data" v-if="bar">
                    <div class="info-content-text "
                         :style="{height:!more ? this.innerHeight - this.head - 156 + 'px':null}">
                        <span v-html="text"></span>
                        <div class="close" v-if="more">
                            <div class="close-inner" @click.prevent="readMore">
                                <img class="close__img" src="../assets/img/arrow.svg" alt="">
                            </div>
                        </div>
                    </div>
                    <div class="info-content-text info-content-text--more" v-if="!more">
                        <span
                                class="info-content-text--link" @click.prevent="readMore">Μάθε περισσότερα</span>
                    </div>
                </div>
            </div>
        </div>
    </section>
</template>

<style lang="scss" scoped>
    a {
        text-decoration: none;
    }

    .close {
        display: flex;
        justify-content: flex-end;

        &-inner {
            display: flex;
            align-items: center;
            justify-content: center;
            border-radius: 50%;
            box-shadow: 0px 10px 25px rgba(74, 144, 226, 0.3);
            background: #fff;
            width: 41px;
            height: 41px;
            cursor: pointer;

        }
    }

    .button {
        background: linear-gradient(88.84deg, #01B016 1.45%, #3FCF34 99.8%);
        border: 1px solid #3CCE32;
        border-radius: 30px;
        width: 267px;
        height: 45px;
        display: flex;
        align-items: center;
        padding: 0 10px;
        justify-content: center;
        font-size: 15px;
        font-weight: 500;
        color: #fff;
        z-index: 9999;

        &-wrap {
            display: flex;
            justify-content: center;
            margin-top: 15px;
            position: relative;
        }
    }

    .copy {
        width: 100%;
        padding: 0 15px;
        color: #b68805;
        font-size: 11px;
        margin-top: 10px;
        text-align: center;
    }

    .last {
        width: 70%;
    }

    .gifts {
        position: absolute;
        bottom: -20px;
        right: -10px;
        z-index: 0;

        img {
            max-width: 136px;
            max-height: 94px;
        }
    }

    .call {
        margin-right: 10px;
        animation: infinite tada 1.2s;
    }

    .bar {
        height: 100%;
        padding-bottom: 250px;
    }

    .footer {
        background: url('../assets/img/gifts.png') no-repeat 110% 70%, linear-gradient(180deg, #FFCF00 0%, #FFC526 100%);
        background-size: 136px;
        box-shadow: 0px -4px 10px rgba(0, 0, 0, 0.1);
        padding: 15px 15px 35px 15px;
        @media (min-height: 575px) {
            position: fixed;
            bottom: 0;
            left: 50%;
            transform: translate(-50%, 0);
            width: 100%;
            max-width: 400px;
        }

        &-title {
            color: #FF263F;
            font-weight: bold;
            text-transform: uppercase;
            font-size: 20px;
            line-height: 23px;
        }

        &-text {
            font-size: 0.875rem;
            line-height: 23px;
            font-weight: 300;

            &--bold {
                font-weight: 500;
            }

            @media (max-height: 667px) {
                line-height: 20px;
            }
        }
    }

    .header {
        background: url("../assets/img/bg.jpg") 20% 0% no-repeat;
        backdrop-filter: blur(4px);
        background-size: 200%;
        padding: 15px;
        @media(min-width: 375px) and (min-height: 685px) {
            padding: 70px 15px 70px 15px;
        }
    }

    .toggle {
        height: 100%;
        display: flex;
        align-items: center;
    }

    .info {
        max-width: 360px;
        margin: 0 auto;

        &-header {
            background: linear-gradient(180deg, #DEDDDD 0%, #F9F9F9 100%);
            height: 41px;
            width: 100%;
            display: flex;
            align-items: center;
            justify-content: space-between;
            border-radius: 8px 8px 0 0;
            padding: 0 15px;

            &__text {
                text-transform: uppercase;
                font-size: 0.875rem;
                font-weight: bold;
                color: #4988D1;
            }
        }

        &-content {
            background: #FFFFFF;
            padding: 20px 15px;

            &-text {
                font-weight: 300;
                font-size: 0.75rem;
                line-height: 0.875rem;
                overflow: hidden;

                &--more {
                    margin-top: 10px;
                }

                &--link {
                    cursor: pointer;
                    color: #4988D1;
                    font-style: normal;
                }
            }
        }
    }

    .player {
        margin-bottom: 20px;
    }

    .gratz {
        color: #FFCE00;
        font-weight: bold;
        font-size: 1.563rem;
        line-height: 1.813rem;
        margin-bottom: 0.375rem;
    }

    .text {
        font-weight: 300;
        color: #fff;
        font-size: 0.875rem;
        line-height: 1rem;

        &--bold {
            font-weight: bold;
        }
    }

    .slide-fade-enter-active {
        transition: all .3s ease;
    }

    .slide-fade-leave-active {
        transition: all .8s cubic-bezier(1.0, 0.5, 0.8, 1.0);
    }

    .slide-fade-enter, .slide-fade-leave-to
        /* .slide-fade-leave-active below version 2.1.8 */
    {
        transform: translateX(10px);
        opacity: 0;
    }

    .toggleOpened {
        transform: rotate(180deg);
    }

    .infoClosed {
        border-radius: 0 0 8px 8px;
    }

    .infoMainClosed {
        margin-bottom: 20px;
    }

    .barInactive {
        padding-bottom: 10px !important;
    }
</style>

<script>
    import player from './player'

    export default {
        data: () => ({
            text: `Όντας ευαίσθητοι στα συναισθήματα των άλλων, τοποθετείτε τα ενδιαφέροντά τους πάνω από το δικό σας, ειδικά αν αυτά τα άτομα είναι πραγματικά κοντά σας. Στην πραγματικότητα είστε ένα πολύ διαισθητικό άτομο. Μια θετική αύρα και ισχυρή ενέργεια σας περιβάλλουν συνεχώς. Νιώθω τις δονήσεις σας πιο ξεκάθαρα από αυτές των άλλων πελατών μου.
<br><br>
Οι επόμενοι μήνες θα φέρουν σοβαρές αλλαγές στη ζωή σας. Οι διαστημικές δυνάμεις θα δηλώσουν την πορεία της ζωής σας. Να είστε έτοιμοι ότι θα πρέπει να κάνετε μια δύσκολη επιλογή που θα επηρεάσει έντονα τη μελλοντική σας ζωή.
<br><br>
Θέλω να είμαι ειλικρινής, οπότε θα σας πω για τον τρόπο που έκανα την πρόβλεψή σας προτού σας δώσω περισσότερες λεπτομέρειες. Η ημερομηνία γέννησής σας, μου επέτρεψε να σχεδιάσω τον αστρολογικό σας χάρτη. Το όνομά σας, μου είπε πάρα πολλά επειδή δεν το έλαβες τυχαία. Το ζώδιο σας, καθώς και ο αριθμός των γραμμάτων στο όνομά σας, μου έδωσαν ακόμη περισσότερες πληροφορίες. Ο αριθμός διαδρομής ζωής σας είναι το 0. Δεν είναι τυχαίο σχήμα και αν κοιτάξετε πίσω, θα δείτε ότι αυτός ο αριθμός σας έχει ακολουθήσει καθ 'όλη τη διάρκεια της ζωής σας.
<br><br>
Το ζώδιο σας, μου δείχνει ότι είστε ένα γοητευτικό  άτομο με ισχυρή θέληση που έχει μια μοναδική ποσότητα ενέργειας. Όπως και οποιοσδήποτε άλλος, μπορείτε να αντιμετωπίσετε τους πάντες. Αυτή είναι η ανθρώπινη φύση μας. Είστε περήφανοι για την ανεξαρτησία σας και την ικανότητά σας να εμπιστεύεστε τις ενέργειες των άλλων αλλά όχι τα λόγια. Αυτή η ποιότητα σας βοήθησε πολύ να εντοπίσετε ένα ψέμα και να αποφύγετε τις προκλήσεις των ξένων.
<br><br>
Τώρα θέλω να συζητήσω τα πράγματα που παλαιότερα μπλοκάρουν την επιτυχία σας. Κάνοντας την πρόβλεψη έπρεπε να αναλύσω το παρελθόν σας. Κάτι σας συνέβη πριν από περίπου πέντε χρόνια και έχει γίνει εμπόδιο από το οποίο εξακολουθείτε να υποφέρετε. Αλλά μην ανησυχείτε, αυτή η στιγμή της ζωής σας δεν είναι μη αναστρέψιμη και θα προσπαθήσουμε να αντιμετωπίσουμε μαζί τις συνέπειες. Όπως μπορώ να δω ότι βρίσκεστε στη φάση δισταγμού αυτήν τη στιγμή και υπάρχουν πολλά πιθανά αποτελέσματα των προβλημάτων που αντιμετωπίσατε πρόσφατα. Είναι καιρός να πάτε με αυτό και να λάβετε τη σωστή απόφαση.
<br><br>
Έχω μια έντονη αίσθηση ότι η ζωή σας έχει επηρεαστεί από κάποιον που σας επιβραδύνει και έτσι εμπόδισε την πρόοδό σας. Επιπλέον, αυτό το άτομο εξακολουθεί να έχει πολύ ισχυρό αντίκτυπο σε εσάς. Και πάλι δεν υπάρχει τίποτα μη αναστρέψιμο και μπορούμε να αλλάξουμε την κατάσταση των πραγμάτων. Μπορώ να δω ξεκάθαρα ότι σύντομα θα επιτύχετε μια θετική καμπή. Επιπλέον, θέλω να πω ότι ένιωσα πολλές θετικές δονήσεις από εσάς. Έχετε αποκτήσει κάποια σημαντικά πλεονεκτήματα και ισχυρές δυνατότητες και είμαι περήφανος που με εμπιστεύεστε γιατί είστε πραγματικά καλός άνθρωπος.
<br><br>
Όπως σας είπα στο εγγύς μέλλον, θα επηρεαστείτε από τον Άρη. Ας προχωρήσουμε στο βασικό σημείο: η οικονομική σας κατάσταση θα αλλάξει και στη συνέχεια θα μπορείτε να φτάσετε στο σημείο καμπής σας. Αλλά δεν είναι όλα αυτά τα νέα. Η δουλειά σας παίζει σημαντικό ρόλο στη ζωή σας και σύντομα θα έχετε την ευκαιρία να αξιοποιήσετε τις δυνατότητές σας σε ένα νέο έργο. Θα συναντήσετε κάποιον που θα σας προσφέρει νέες συνθήκες εργασίας, αλλά μην δώσετε βιαστικές απαντήσεις και συμβουλευτείτε ένα άτομο που εμπιστεύεστε. Τότε θα μπορείτε να λάβετε τη σωστή απόφαση.
<br><br>
Έτσι, αυτή η περίοδος θα σας προσφέρει σημαντική και απροσδόκητη οικονομική ευκαιρία που μπορεί να αλλάξει έντονα τη ζωή σας και να γίνει ένα σημείο καμπής για εσάς και την οικογένειά σας.
<br><br>
Τώρα είναι η περίοδος που πρέπει να κάνετε το καλύτερο δυνατό για να κάνετε τη ζωή σας καλύτερη - τα τρέχοντα πράγματα έχουν το μυστικό τους νόημα, καθώς και τι έχει ήδη συμβεί και τι θα συμβεί στο μέλλον. Είναι αρκετά ενδιαφέρον καθώς έχετε ήδη αντιμετωπίσει τέτοιες περιόδους στο παρελθόν, αλλά δεν μπορούσατε να ενεργήσετε γιατί κανείς δεν σας είχε προειδοποιήσει. Το γεγονός ότι ακούτε την πρόβλεψη με κάνει να πιστεύω ακράδαντα ότι η αστρολογική επιρροή σας έχει φτάσει στην κορυφή της και θα χρησιμοποιήσετε όλα τα δυνατά σημεία. Σύμφωνα με αυτό, δεν θέλω να χάσετε ξανά μια ευκαιρία.
<br><br>

Το άγχος που βιώσατε πρόσφατα σας αφήνει να νιώσετε τη δύναμή σας όπως ποτέ άλλοτε. Ο γενέθλιος πίνακας μου δείχνει ότι υπάρχει μεγάλη αγάπη στις σχέσεις με τον σύντροφό σας. Ωστόσο, υπάρχει επίσης έλλειψη αμοιβαίας κατανόησης. Αυτή η ένταση μπορεί να προκληθεί από τον Άρη που μπλοκάρει τον αστρικό σας ουρανό. Ένας νέος κύκλος εμποδίων θα ξεκινήσει σε 9 ημέρες και θα διαρκέσει για 103 ημέρες. Αλλά αυτή η περίοδος θα σας βοηθήσει να λύσετε τα τρέχοντα προβλήματα. Ξέρω ότι οι σχέσεις σας είναι απαραίτητες για εσάς και αγαπάτε τον σύντροφό σας (και είναι αμοιβαίο, πιστέψτε με). Γι 'αυτό χαίρομαι που σας ενημερώνω ότι σύντομα θα μπορέσετε να βελτιώσετε την κατάστασή σας και να ξεκινήσετε μια νέα ευτυχισμένη σελίδα της ιστορίας σας. Όλες οι δυσκολίες που αντιμετωπίσατε στο παρελθόν θα εξαφανιστούν. Δεν εννοώ ότι θα επαναφέρετε τα πάντα. Αυτό θα είναι εντελώς ένα νέο στάδιο στις σχέσεις σας με βάση την ειλικρίνεια και την αμοιβαία εμπιστοσύνη. Φυσικά πρέπει να ετοιμαστείτε για αυτό και αν θέλετε να λύσετε όλα τα προβλήματα μαζί και να προχωρήσετε προς την ίδια κατεύθυνση, και οι δύο θα πρέπει να αναπτύξετε το δικό σας προσωπικούς και εσωτερικούς κόσμους. Αυτό θα σας βοηθήσει όχι μόνο να αποκαταστήσετε τις σχέσεις σας αλλά και να τις γεμίσετε με αμοιβαία κατανόηση, φροντίδα, αγάπη, υποστήριξη και αρμονία. Τα οικονομικά προβλήματα που έκαναν τα πράγματα χειρότερα θα επιλυθούν επιτυχώς. Θα βελτιώσει επίσης τις σχέσεις σας και ως ζευγάρι θα έχετε μια αρμονική και ευτυχισμένη συνεργασία.
<br><br>
Ωστόσο, τίποτα δεν θα αλλάξει χωρίς τη θέλησή σας και την επιθυμία να αλλάξετε τα πράγματα. Επομένως, πρέπει να κάνετε το καλύτερο δυνατό και να παίξετε τον κύριο ρόλο στη ζωή σας.
<br><br>
Τώρα είναι καλύτερο να αφιερώσετε το χρόνο σας στη δουλειά που σας κάνει ευτυχισμένους και απόλυτα ικανοποιημένους. Είμαι στην ευχάριστη θέση να σας πω για όλα τα πράγματα γιατί όλα θα αλλάξουν σύντομα. Αυτή η δύσκολη περίοδος είναι μόνο μια προσωρινή κατάσταση που θα ενισχύσει τις σχέσεις σας και θα σας κάνει να εκτιμήσετε ακόμη περισσότερο μετά από όλες τις δυσκολίες και τις προκλήσεις που έχετε ξεπεράσει μαζί.
<br><br>
Πάρτε όλες τις δοκιμασίες της ζωής, τον πόνο και τις απογοητεύσεις που έχετε ζήσει ως το κάρμα, μην το σκέφτεστε πια και αφήστε τα πάντα στο παρελθόν. Είστε στο δρόμο για ένα νέο στάδιο στη ζωή σας και οι αποφάσεις που θα λάβετε εντός της περιόδου θα είναι σημαντικές, καθώς η επιλογή σας θα επηρεάσει όχι μόνο την τρέχουσα ώρα, αλλά και το μέλλον σας. Όπως έχω ήδη πει, το γεγονός ότι ακούτε την πρόβλεψή μου δεν είναι τυχαίο, βλέπω ότι γνωρίζετε ήδη κάποιες αλλαγές. Γι 'αυτό χρειάζεστε τη βοήθειά μου. Πρέπει επίσης να εντοπίσετε άτομα που θα σας βοηθήσουν και θα σας υποστηρίξουν, καθώς και εκείνους με τους οποίους είναι καλύτερο να σταματήσετε την επικοινωνία. Προσπαθήστε να αποφύγετε παγίδες που μπορούν να σας εμποδίσουν να φτάσετε στο επιθυμητό αποτέλεσμα. Όλες οι πτυχές της ζωής σας επηρεάζουν η μία την άλλη και ήρθε η ώρα να αναλάβετε την ευθύνη για το πεπρωμένο σας.
<br><br>
Για να προστατευτείτε από τα προβλήματα αυτόν τον μήνα πρέπει να γνωρίζετε 5 βασικούς λόγους για την εμφάνισή τους. Ένα από αυτά είναι τα αρνητικά συναισθήματα. Προσπαθήστε να αποκλείσετε τα συναισθήματα του φθόνου, του θυμού και της εκδίκησης. Διαφορετικά, δεν θα καταστρέψουν μόνο το ενεργειακό σας πεδίο αλλά θα το καταστρέψουν εντελώς.
Τα επόμενα στάδια είναι αρνητικές στάσεις και προβλήματα υγείας. Πρέπει να υπενθυμίζετε συνεχώς στον εαυτό σας ότι είστε επιτυχημένος και τυχερός άνθρωπος. Παρακολουθήστε την υγεία σας για να αποφύγετε την εξάντληση των ενεργειακών σας πόρων. Αργότερα θα σας δώσω μια πιο λεπτομερή λίστα με τα πράγματα που πρέπει να κάνετε και δεν πρέπει, τα αστέρια τα οποία μου επέστησαν την προσοχή μου σε αυτό.
Και το τελευταίο αλλά όχι λιγότερο σημαντικό - το αίσθημα ενοχής και το να είσαι σε λάθος περιβάλλον. Μην ξεχάσετε να ζητήσετε συγχώρεση για αυτό που έχετε κάνει λάθος. Και αν φοβάστε να παρεξηγηθείτε τότε θα πρέπει να αρχίσετε να σκέφτεστε εάν οι άνθρωποι που σας περιβάλλουν είναι οι σωστοί. Έχω συνθέσει μια πλήρη περιγραφή του τι πρέπει να κάνετε για να επιτύχετε την επιτυχία και να βγάλετε κέρδος αυτό το μήνα.
<br><br>
Συνολικά, μπορώ να πω ότι το μέλλον δεν είναι εντελώς λαμπρό για εσάς. Οι κύριες απειλές στο δρόμο σας θα είναι οι απώλειες, τα χρέη και η υψηλή πιθανότητα απώλειας του σπιτιού σας. Σας συμβουλεύω να είστε προσεκτικοί όταν επιλέγετε φίλους, συναδέλφους και συνεργάτες. Οι άνθρωποι που τυχαίνει να είναι γύρω σας μπορεί να θέλουν να αποκομίσουν κέρδος από τη γενναιοδωρία, την ειλικρίνεια και την αξιοπρέπεια σας. Μην αφήνετε τους άλλους να σας μαγέψουν. Η εμφάνιση μπορεί να είναι παραπλανητική. Δεν θέλουν όλοι όσοι σας λένε κάτι ωραίο να είναι φίλοι σας και αντίστροφα.
Σας συμβουλεύω να αναβάλλετε την αγορά ακριβών αντικειμένων και να βασίζεστε μόνο στα χρήματα που μπορείτε να ξοδέψετε ελεύθερα. Ένα λεπτό αδυναμίας μπορεί να οδηγήσει σε απώλεια του σπιτιού σας, του πλούτου και των αποταμιεύσεων. Θυμηθείτε ότι μπορείτε να κάψετε τη γέφυρα της ευημερίας σας σε ένα λεπτό, αλλά θα χρειαστούν μήνες ή και χρόνια για να την επισκευάσετε. Να είστε λιγότερο παράτολμοι. Τα εύκολα χρήματα δεν θα σας φέρουν την ευτυχία, αλλά θα σας οδηγήσουν σε μεγάλο πρόβλημα.
<br><br>
Παρά το γεγονός ότι αυτός ο μήνας είναι γενικά ευνοϊκός για το πρόγραμμά σας, μπορεί να φέρει σοβαρό κίνδυνο. Υπάρχει μεγάλη πιθανότητα προβλημάτων ύπνου, υπερβολικής εργασίας, επιδείνωσης της γενικής κατάστασης άγχους, κατάθλιψης και μελαγχολίας. Σας συνιστώ να αναθεωρήσετε το πρόγραμμα εργασίας σας, δίνοντας περισσότερο χρόνο και προσοχή στην ξεκούραση, στην προσευχή και στην υγεία. Φροντίστε το σώμα σας. Ο ξαφνικός πόνος θα σας πει ποια μέρη του επηρεάζονται από τον τρόπο ζωής σας. Λάβετε υπόψη τον υψηλό κίνδυνο αλλεργίας ή εθισμού στα φάρμακα.
Η θέση των αστεριών δείχνει ξεκάθαρα ότι πρέπει να αλλάξετε το συνηθισμένο περιβάλλον για λίγο και να βρεθείτε σε διαφορετικό κλίμα. Διαφορετικά, το άγχος και η κατάθλιψη θα γίνουν ένα διαρκές κομμάτι της ζωής σας και τελικά θα οδηγήσουν σε σοβαρές ασθένειες και συναισθηματική εξάντληση.
Είναι κοινή γνώση ότι ένας μακρύς δρόμος είναι ευχάριστος μόνο όταν υπάρχει ένα σπίτι όπου μπορείτε να επιστρέψετε. Σίγουρα, πρέπει να αφήσετε την οικογένειά σας για δουλειά, αλλά μην απομακρυνθείτε από αυτήν πολύ μακριά και για μεγάλο χρονικό διάστημα. Τα συχνά μακροχρόνια επαγγελματικά ταξίδια, η παραμονή αργά στη δουλειά μπορεί να είναι κερδοφόρα, αλλά αξίζει πραγματικά; Είναι καιρός να αρχίσετε να ακούτε τα αγαπημένα σας πρόσωπα. Διαφορετικά, η δύναμη των οικογενειακών δεσμών σας θα εξασθενίσει και μπορεί να χαθεί για πάντα. Μην περιορίζετε την επικοινωνία σας με τους αγαπημένους σας. Το αύριο, για το οποίο ελπίζεις, δεν θα έρθει ποτέ. Σας συμβουλεύω ειλικρινά να περνάτε λιγότερο χρόνο στη δουλειά και να μην θυσιάζετε την οικογενειακή σας σχέση στον βωμό της καριέρας σας. Θυμηθείτε ότι τίποτα δεν είναι τόσο καταθλιπτικό όσο η μοναξιά στην κορυφή που έχετε φτάσει. Για να μοιραστείτε όλες τις επιτυχίες σας με τους αγαπημένους σας, πρέπει να διατηρήσετε ισχυρή σχέση μαζί τους. Δώστε προσοχή στη διάθεση των παιδιών και του συζύγου σας. Είναι ευτυχισμένοι? Δεν αισθάνονται απορριφθέντες; Ελάτε στον κόσμο τους!
<br><br>
Είστε ένα ισχυρό και υπεύθυνο άτομο, το αισθάνομαι αυτό. Θέλω να καταλάβετε ότι δεν υπάρχουν εμπόδια στο δρόμο σας προς την ευτυχία και ότι αξίζετε το καλύτερο. Να είστε έτοιμοι να εκμεταλλευτείτε όλες τις πιθανότητες!
`,
            more: false,
            cropedText: '',
            footerHeight: null,
            bar: true,
            contentPadding: null,
            innerHeight: window.innerHeight,
            head: null
        }),
        components: {player},
        methods: {
            readMore() {
                this.more = !this.more
            },
            toggleBar() {
                this.bar = !this.bar
            },
            injectHeight() {
                let innerHeight = window.innerHeight
                if (innerHeight < 575) {
                    this.footerHeight = 0
                } else {
                    this.footerHeight = 300
                }
            },
            contentHeight() {
                let innerHeight = window.innerHeight
                let app = document.getElementById('app')
                this.contentPadding = innerHeight - (app.clientHeight) - 30
                console.log(innerHeight)
                console.log(app.clientHeight)
            }

        },
        computed: {
            readHeight: function () {
                return {
                    paddingBottom: this.more ? this.footerHeight + 'px' : 0
                }
            }
        },
        mounted() {
            this.injectHeight()
            this.contentHeight()
            this.head = this.$refs.header.clientHeight
        }
    }
</script>